In [13]:
import pandas as pd; import numpy as np

ser=pd.Series(["Sam",np.nan,"Tim","Kim"])
ser

0    Sam
1    NaN
2    Tim
3    Kim
dtype: object

In [14]:
ser.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [15]:
ser.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [19]:
ser[3] = None

ser

0     Sam
1     NaN
2     Tim
3    None
dtype: object

In [20]:
ser.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [22]:
ser.dropna()

0    Sam
2    Tim
dtype: object

In [24]:
ser[ser.notnull()]

0    Sam
2    Tim
dtype: object

In [25]:
df = pd.read_table('data5.txt', sep=',')
df

   name  score  sex
0   Tim   80.0  NaN
1   Tom    NaN  Tom
2  Kate   70.0  n.a
3   NaN   90.0    K
4   Kim   -5.0    K

In [26]:
df.dropna()

   name  score  sex
2  Kate   70.0  n.a
4   Kim   -5.0    K

In [35]:
from numpy import nan as NA
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [36]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [48]:
df.dropna(how="any", axis=0)

     0    1    2
0  1.0  2.0  3.0

In [50]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [62]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [64]:
df[1] = NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [65]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [66]:
df.dropna(axis=1, how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [67]:
df.dropna(axis=1, how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [71]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [69]:
df.dropna(thresh=1)

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [70]:
df.dropna(thresh=2)

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [75]:
df.dropna(thresh=3)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [80]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [77]:
df.dropna(thresh=1, axis=1)

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [78]:
df.dropna(thresh=2, axis=1)

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [79]:
df.dropna(thresh=3, axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [83]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [81]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [84]:
df.fillna(value={0: 15, 1: 25, 2: 100})

      0     1      2
0   1.0  25.0    3.0
1   4.0  25.0    5.0
2  15.0  25.0  100.0

In [158]:
df.fillna(value={0: 1})

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  1.0  NaN  NaN

In [88]:
df.fillna(value=0, inplace=True)
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [128]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [129]:
df.fillna(method='ffill')

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [130]:
df.fillna(method='ffill', limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [131]:
data=pd.Series([1,0,NA,5])
data

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [132]:
data.fillna(data.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [133]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [134]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0

In [136]:
df.fillna(value={0: 1, 1: df[1].mean(), 2: df[2].std()})

     0    1         2
0  1.0  2.0  3.000000
1  4.0  2.0  5.000000
2  1.0  2.0  1.414214

In [155]:
df.fillna(value={0: 1, 1: df[1].mean(), 2: df[2].map(lambda x: 3 if not x==np.nan else '')})

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  1.0  2.0  3.0